Repository: BuenoVini/SparkflyBlazor
Catalog: Sparkfly.Main/Pages/InfoPage.*.resx
Languages: pt

# about_1
source: Hi, my name is Vinícius but you can call me Vini. I am a Computer Science student living in Brazil. This web app is a personal project that I created to sharpen my C# skills (pun very much intended!).
pt: Olá, meu nome é Vinícius, mas pode me chamar de Vini. Eu sou estudante de Ciências da Computação na UNESP de Rio Claro. Este aplicativo web é um projeto pessoal que criei para aprimorar minhas habilidades de C#.

# about_2
source: When I started my internship in 2022, I heard people talking about Blazor and how easy you could create Single Page Applications. The ideia behind Sparkfly was to create a service that would solve a common problem that my friends from college and from work were having.
pt: Quando comecei meu estágio em 2022, ouvi pessoas falando sobre o Blazor e como é fácil criar SPAs (Single Page Applications). A ideia por trás do Sparkfly era criar um serviço que resolvesse um problema comum que meus amigos da faculdade e do trabalho estavam tendo.

# about_3
source: Every Friday, when I am commuting to college, the van's driver allows us to listen to Spotify. Concidently, every Friday at work, we listen to some music in the office too. The issue is that if you want to suggest a song to play, you would have to ask the owner of the Spotify account which songs to play next. That's when I had the idea to create Sparkfly.
pt: Toda sexta-feira, quando vou para a faculdade, o motorista da van nos permite ouvir o Spotify. Por coincidência, todas as sextas-feiras no trabalho, também ouvimos música no escritório. O problema é que, se você quiser sugerir uma música para tocar, terá que perguntar ao dono da conta do Spotify quais músicas tocar em seguida. Foi aí que tive a ideia de criar o Sparkfly.

# about_4
source: Also, since I decided to learn C# in 2022 I was thinking about a project I could build to put my skills in practice. Allied with my passion for listening to music, I was very pumped to start building this application and see my friends using it.
pt: Além disso, desde que decidi aprender C# em 2022, estava pensando em um projeto que eu pudesse construir para colocar minhas habilidades em prática. Aliado à minha paixão por ouvir música, fiquei muito empolgado para começar a fazer este aplicativo e ver meus amigos usando-o.

# about_5
source: I really hope you enjoy and have some fun sharing your favorite songs with you friends! This project was made with many sleepless nights but with a lot of love, for sure!
pt: Eu realmente espero que você goste e se divirta compartilhando suas músicas favoritas com seus amigos! Esse projeto foi feito com muitas noites sem dormir mas com muito amor, com certeza!

# about_6
source: If you have time, I'd be very happy if you visited my social medias!
pt: Se você tiver um tempinho, eu ficaria muito feliz se você visitasse minhas redes sociais!

# about_7
source: Oh, and why Sparkfly as the name? Well, you can find the answer if you know where to look at, but I won't be the one telling you where. Good luck!
pt: Ah, e por que o nome é Sparkfly? Bem, você pode encontrar a resposta se souber onde procurar, mas não será eu quem lhe dirá onde. Boa sorte!

# github
source: On my Github you can check previous projects I've worked on. (If you click the GitHub icon on the top right corner you'll be directed to projects's repo)
pt: No meu Github você pode conferir os projetos anteriores em que trabalhei. (Se clicar no ícone do GitHub no canto superior direito, será direcionado para o repositório do projeto)

# hello
source: Hello there!
pt: Olá!

# lastfm
source: Lastly (another pun!), you can check the kinda music I'm into listening by checking my Last.fm profile. Spoiler alert: there's a lot of Taylor Swift!
pt: Por fim, você pode conferir o tipo de música que eu gosto de ouvir no meu perfil do Last.fm. Alerta de spoiler: tem muita Taylor Swift!

# linkedin
source: If you liked Sparkfly, please send me a message on LinkedIn telling me your thoughts.
pt: Se você gostou do Sparkfly, por favor me envie uma mensagem no LinkedIn contando sua opinião.

# page_title
source: About Sparkfly
pt: Sobre o Sparkfly

# section_1
source: A bit about me
pt: Um pouquinho sobre mim

# section_2
source: The problem at hand
pt: O problema em questão

# section_3
source: Let's keep in touch!
pt: Agradecimentos e contato

# social_media
source: My social media profiles:
pt: Minhas redes:
