Repository: BuenoVini/SparkflyBlazor
Catalog: Sparkfly.Main/Pages/WelcomePage.*.resx
Languages: pt

# about_1
source: Sparkfly is an open source app that allows you and your friends to listen to music together using the Spotify queue.
pt: Sparkfly é um aplicativo de código aberto que permite que você e seus amigos ouçam música juntos usando a fila do Spotify.

# about_2
source: Before we can start, tell us your name in the box below. This will help your party peers identify which amazing songs you have voted for and how awesome your music taste is (or not...)!
pt: Antes de começarmos, diga-nos o seu nome na caixa abaixo. Isso ajudará seus colegas de festa a identificar em quais músicas incríveis você votou e quão incrível é (ou não) seu gosto musical!

# about_3
source: Just kidding, here we have space for every taste! From Metallica to Lady Gaga, make Sparkfly your home!
pt: Brincadeirinha, aqui temos espaço para todos os gostos! De Metallica à Lady Gaga, faça do Sparkfly a sua casa!

# alert
source: Please, to continue, write your name in the box above and try again!
pt: Por favor, para continuar, escreva o seu nome na caixa acima e tente de novo!

# btn_enter
source: LOG IN AS GUEST
pt: ENTRAR COMO CONVIDADO

# btn_spotify
source: LOG IN WITH SPOTIFY
pt: ENTRAR COM SPOTIFY

# guide_1
source: If you are a guest, you're ready to start listening to your and your friends' favorite songs, just press this button to start 👇
pt: Se você é um convidado, você já está pronto para começar a ouvir suas músicas favoritas e as de seus amigos, basta pressionar este botão para inicar 👇

# guide_2
source: If you are the party host, please login using your Spotify account so that Sparkfly can queue songs for you and your friends!
pt: Se você é o dono da festa, faça o login usando sua conta do Spotify para que o Sparkfly possa enfileirar as músicas para você e seus amigos!

# name_helper
source: Be creative! You can use your favorite emoji alongside your name.
pt: Seja criativo! Você pode usar o seu emoji favorito ao lado do seu nome.

# name_label
source: Type in your name
pt: Digite seu nome

# welcome
source: Welcome to SPARKFLY!
pt: Bem-vindos ao SPARKFLY!
